# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k),
# не превосходящие числа N.
# 10 -> 1 2 4 8

N = int(input("Введите число: "))
num = 1
while num <= N:
    print(num, end= ' ')
    num = num * 2

# n = int(input("Введите число: "))
# i = 0
# while 2 ** i <= n:
#     print(2 ** i, end= ' ')
#     i +=1